app/Filters/AuthUserManagerFilter.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '7CCqOrSitG'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        if (!session()->get('SES_AUTH_USER_ID')) {
            return redirect()->to('/login');
        }

        $profile = new \App\Models\User();
        $profile = $profile->find(session()->get('SES_AUTH_USER_ID'));