app/Controllers/PaymentMethodController.php

SELECT *
FROM `payment_methods`
WHERE `payment_methods`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new PaymentMethod();
        $pass = [
            'paymentMethods' => $model->orderBy('created_at', 'DESC')->findAll()
        ];