app/Controllers/ProductController.php

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new Product();
        $products = $model->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
AND `products`.`id` = 'P000000002'
SELECT *
FROM `product_categories`
WHERE `product_categories`.`deleted_at` IS NULL
ORDER BY `id` ASC
SELECT *
FROM `product_units`
WHERE `product_units`.`deleted_at` IS NULL
ORDER BY `id` ASC
---
    public function edit($id)
    {
        $model = new Product();
        $modelCategory = new ProductCategory();
        $modelUnit = new ProductUnit();
        $pass = [
            'data' => $model->find($id),
            'productCategories' => $modelCategory->orderBy('id', 'ASC')->findAll(),
            'productUnits' => $modelUnit->orderBy('id', 'ASC')->findAll()
        ];