app/Controllers/ProductCategoryController.php

    public function index()
    {
        $model = new ProductCategory();
        $pass = [
            'productCategories' => $model->orderBy('created_at', 'DESC')->findAll()
        ];
---
SELECT *
FROM `product_categories`
WHERE `product_categories`.`deleted_at` IS NULL
ORDER BY `created_at` DESC