app/Models/Product.php

SELECT *
FROM `product_categories`
WHERE `id` = 'PC00000009'
---
    public function getCategory($productCategoryId)
    {
        $db = Database::connect();
        $productModel = $db->table('product_categories')->where('id', $productCategoryId)->get();