app/Views/layouts/partials/navbar.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '7CCqOrSitG'
---
<?php
$profile = new App\Models\User();
$profile = $profile->find(session()->get('SES_AUTH_USER_ID'));