app/Views/layouts/partials/sidebar.php

  function is_active_menu($urlSegment)
  {
    $uri = service('uri');
    $currentURL = $uri->getPath();
    return (strpos($currentURL, $urlSegment) !== false) ? 'active open' : '';
  }
}
$profile = new App\Models\User();
$profile = $profile->find(session()->get('SES_AUTH_USER_ID'));
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '7CCqOrSitG'